#+TITLE: Personal config of orgmode

** Drills
#+begin_src emacs-lisp
(after! org
  (my/org/add-to-capture '("A" "Democracy: The God that Failed"
                           entry
                           (id "drill-dem")
                           "** %^{Title} :drill:
    :PROPERTIES:
    :END:
 Added: %U
,*** Definition
%?
"
                           ))
  (my/org/add-to-capture '("M" "Myth"
                           entry
                           (id "drill-myth")
                           "** %^{Title} :drill:
    :PROPERTIES:
    :END:
 Added: %U
,*** Definition
%?
"
                           ))
  (my/org/add-to-capture '("L" "Lord of the Rings"
                           entry
                           (id "drill-lotr")
                           "** %^{Title} :drill:
    :PROPERTIES::
    :END:
 Added: %U
,*** Definition
%?
"
                           ))
  (my/org/add-to-capture '("D" "Dune"
                           entry
                           (id "drill-dune")
                           "** %^{Title} :drill:
    :PROPERTIES::
    :END:
Added: %U
,*** Definition
%?
"
                           ))
  (my/org/add-to-capture '("C" "Church"
                           entry
                           (id "drill-church")
                           "** %^{Title} :drill:
    :PROPERTIES::
    :END:
Added: %U
,*** Definition
%?
"
                           ))
  (my/org/add-to-capture '("S" "Stoicism"
                           entry
                           (id "drill-stoic")
                           "** %^{Title} :drill:
:PROPERTIES:
:DRILL_CARD_TYPE: twosided
:END:
Added: %U
,*** Definition
%?"
                           ))
  )
#+end_src

#+RESULTS:
| S | Stoicism | entry | (id drill-stoic) | ** %^{Title} :drill: |

